ednieuw/ESP32-HC12/Character_Clock_V117_PA03/Character_Clock_V117_PA03.ino
// =============================================================================================================================
/* 
This Arduino code controls the ATMEGA328 ot ARMEGA1284 chip on the PCB board that controls the LED strips of the Word Clock
This source contains code for the following modules:  
- RTC DS3231 ZS-042 clock module
- KY-040 Keyes Rotary Encoder
- LDR light sensor 5528
- Bluetooth RF Transceiver Module HC05
- DCF77 module DCF-2
- FM Stereo Radio Module RDA5807M RRD-102V2.0  
- Red_MAX7219_8-Digit_LED_Display
- I2C LCD display
A 74HC595 ULN2803APG combination regulates the LEDs by shifting in bits into the 74HC595 LED are turn On or Off
A FT232RL 5.5V FTDI USB to TTL Serial Module can be attached to program te ATMEGA and read the serial port
The HC05 or HM-10 Bluetooth module is used to read and write information or instructions to the clock
The DCF77 module can be attached to adjust the time to the second with German longwave time signal received by the module
The FM-module can be used to read the RDS-time from radio station or to play FM-radio station from within the clock

 Author .: Ed Nieuwenhuys
 Changes.: V107 Rotary bug, "noise on AC line", solved by changing rotary press/rotate options
 Changes.: V108 Changed time settings in rotary for Kees Soeters. Time text in ShiftInTime function instead from array
 Changes.: V109 Added features of Character_Colour_Clock_V067 like KEYPADs Menu structure, EEPROM struct
                 Solved all compiler warning. UseDCF turns off LED on board when turned Off. Use DCF added to menu
                 Changed constrain(mem,0,250) -->= min(mem,250)
 Changes.: V110 Added OneWire keypad 3x1 and 3x4
 Changes : V111 Bugfixes 
 Changes : V112 Clear NVRAM in menu option C. Store more menu text in PROGMEM  
 Changes : V113 Added option W in menu; Test LDR every second. 
 Changes : V114 DCF printing in DCFcheck()   
 Changes : V115 Klok Merijn No12
 Changes : V116 Rotary and KEYPAD entries updated. RTCklok.getTemperature()); in Dimleds(). DCF_count added
 Changes : V117 Debugged RotaryEncoderCheck(void)
 Changes : V117 PA02 Added HC12 voor Paul Andries
 Changes : V117 PA03 Menu option L, M, N and O can also be sent to with ESP32ArduinoCommV031
 */
// ===============================================================================================================================
char VERSION[] = "Character_Clock_V117PA03";
//--------------------------------------------
// ARDUINO Definition of installed modules
//--------------------------------------------
#define MOD_DS3231                  // The DS3231 module is installed, if not defined the Arduino internal clock is used
//#define ROTARYMOD                 // Use a rotary encode

                    // HC12 or Bluetooth; same pins 6 and 7
#define HC12MOD                    // Use HC12 time transreceiver Long Range Wireless Communication Module in Bluetooth slot (pin 6 and 7)
//#define BLUETOOTHMOD              // Bluetooth module connected to BT_RX BT_TX (pin 6 and 7)


//#define DCF77MOD                 // DCF77 installed
//#define FOURWIREKEYPAD           // 4 buttons and 4 wires (Do NOT use with Bluetooth on pin 6 & 7 or change connection pins) 
                                   // Bluetooth on pin RX&TX (0&1)
//#define ONEWIREKEYPAD3x1         // Use a 3x1 keypad with one wire   
//#define LCDMOD
//#define MAX7219_8DIGIT           // Only with 1284. Not enough pins on ATMEGA328
//#define DS1820                   // Only with 1284
//#define LCDMOD                   // For LCD support 
//#define ONEWIREKEYPAD3x4         // Use a 3x4 keypad with one wire
//                                                                                            //
//--------------------------------------------
// ARDUINO Definition of installed language word clock
//--------------------------------------------
 #define NL
// #define UK
//--------------------------------------------
// ARDUINO Includes defines and initialysations
//--------------------------------------------
// Get the LCD I2C Library here: 
// https://bitbucket.org/fmalpartida/new-liquidcrystal/downloads
// Move any other LCD libraries to another folder or delete them
// See Library "Docs" folder for possible commands etc.
#include <Wire.h>
#include <EEPROM.h>
#include <RTClib.h>
                     #ifdef LCDMOD
#include <LiquidCrystal_I2C.h>
                     #endif //LCDMOD
                     #ifdef HC12MOD
#include <SoftwareSerial.h>                 // for Bluetooth communication
                     #endif //HC12MOD
                     #ifdef BLUETOOTHMOD
#include <SoftwareSerial.h>                 // for Bluetooth communication
                     #endif //BLUETOOTHMOD
                     #ifdef ROTARYMOD
#include <Encoder.h>
                     #if defined(__AVR_ATmega1284P__) || defined(__AVR_ATmega1284__)
  #define CORE_NUM_INTERRUPT 3
  #define CORE_INT0_PIN   10
  #define CORE_INT1_PIN   11
  #define CORE_INT2_PIN   2
                     #endif
                     #endif //ROTARYMOD
                     #ifdef DCF77MOD
#include <DCF77.h>
#include <TimeLib.h>
                     #endif //DCF77MOD
                     #ifdef MAX7219_8DIGIT
#include <LedControl.h>
                     #endif //MAX7219_8DIGIT
                     #ifdef DS1820
#include <DallasTemperature.h>
                     #endif //DS1820
/*                #ifdef NL
                // Old Clock display lay-out
#define HET     ShiftInTime("Het ",    0, 1,Toggle_HetWasIs,0);   
#define IS      ShiftInTime("is ",     1, 1,Toggle_HetWasIs,1);
#define WAS     ShiftInTime("was ",    2, 1,Toggle_HetWasIs,2);
#define PRECIES ShiftInTime("precies ",3, 1,              1,3);
#define MVIJF   ShiftInTime("vijf ",   4, 1,              1,4);
#define KWART   ShiftInTime("kwart ",  5, 1,              1,5);
#define MTIEN   ShiftInTime("tien ",   6, 1,              1,6);
#define OVER    ShiftInTime("over ",   7, 1,              1,7);

#define VOOR    ShiftInTime("voor ",   8, 2,              1,0);
#define HALF    ShiftInTime("half ",   9, 2,              1,1);
#define TWAALF  ShiftInTime("twaalf ",10, 2,              1,2);
#define ELF     ShiftInTime("elf ",   11, 2,              1,3);
#define EEN     ShiftInTime("een ",   12, 2,              1,4);
#define TIEN    ShiftInTime("tien ",  13, 2,              1,5);
#define TWEE    ShiftInTime("twee ",  14, 2,              1,6);
#define NEGEN   ShiftInTime("negen ", 15, 2,              1,7);

#define DRIE    ShiftInTime("drie ",  16, 3,              1,0);
#define ACHT    ShiftInTime("acht ",  17, 3,              1,1);
#define VIER    ShiftInTime("vier ",  18, 3,              1,2);
#define ZEVEN   ShiftInTime("zeven ", 19, 3,              1,3);
#define VIJF    ShiftInTime("vijf ",  20, 3,              1,4);
#define ZES     ShiftInTime("zes ",   21, 3,              1,5);
#define UUR     ShiftInTime("uur ",   22, 3,              1,6);
#define EDSOFT  ShiftInTime("Edsoft ",23, 3, ToggleEdsoft  ,7);
                #endif //NL
*/            // new lay-out   
                #ifdef NL
#define HET     ShiftInTime("Het ",    0, 1,Toggle_HetWasIs,0);
#define IS      ShiftInTime("is ",     1, 1,Toggle_HetWasIs,1);
#define WAS     ShiftInTime("was ",    2, 1,Toggle_HetWasIs,2);
#define MVIJF   ShiftInTime("vijf ",   3, 1,              1,3);
#define MTIEN   ShiftInTime("tien ",   4, 1,              1,4);
#define KWART   ShiftInTime("kwart ",  5, 1,              1,5);
#define VOOR    ShiftInTime("voor ",   6, 1,              1,6);
#define OVER    ShiftInTime("over ",   7, 1,              1,7);

#define PRECIES ShiftInTime("precies ",8, 2,              1,0);
#define HALF    ShiftInTime("half ",   9, 2,              1,1);
#define ELF     ShiftInTime("elf ",   10, 2,              1,2);
#define VIJF    ShiftInTime("vijf ",  11, 2,              1,3);
#define TWEE    ShiftInTime("twee ",  12, 2,              1,4);
#define EEN     ShiftInTime("een ",   13, 2,              1,5);
#define VIER    ShiftInTime("vier ",  14, 2,              1,6);
#define TIEN    ShiftInTime("tien ",  15, 2,              1,7);

#define TWAALF  ShiftInTime("twaalf ",16, 3,              1,0);
#define DRIE    ShiftInTime("drie ",  17, 3,              1,1);
#define NEGEN   ShiftInTime("negen ", 18, 3,              1,2);
#define ACHT    ShiftInTime("acht ",  19, 3,              1,3);
#define ZES     ShiftInTime("zes ",   20, 3,              1,4);
#define ZEVEN   ShiftInTime("zeven ", 21, 3,              1,5);
#define UUR     ShiftInTime("uur ",   22, 3,              1,6);
#define EDSOFT  ShiftInTime("Edsoft ",23, 3, ToggleEdsoft  ,7);
                #endif //NL

