ednieuw/ESP32-HC12/Character_Clock_V117_PA03/Character_Clock_V117_PA03.ino
                #ifdef UK
#define HET     ShiftInTime("It ",     0, 1,Toggle_HetWasIs,0);
#define IS      ShiftInTime("is ",     1, 1,Toggle_HetWasIs,0);
#define WAS     ShiftInTime("was ",    2, 1,Toggle_HetWasIs,0);
#define PRECIES ShiftInTime("exact "  ,3, 1,              1,3);
#define HALF    ShiftInTime("half ",   4, 1,              1,4);
#define TWINTIG ShiftInTime("twenty ", 5, 1,              1,5);
#define MVIJF   ShiftInTime("five ",   6, 1,              1,6);
#define KWART   ShiftInTime("quarter ",7, 1,              1,7);

#define MTIEN   ShiftInTime("ten ",    8, 2,              1,0);
#define OVER    ShiftInTime("past ",   9, 2,              1,1);
#define ZES     ShiftInTime("six ",   10, 2,              1,2);
#define TWEE    ShiftInTime("two ",   11, 2,              1,3);
#define VIJF    ShiftInTime("five ",  12, 2,              1,4);
#define TWAALF  ShiftInTime("twelve ",13, 2,              1,5);
#define TIEN    ShiftInTime("ten ",   14, 2,              1,6);
#define ELF     ShiftInTime("eleven ",15, 2,              1,7);

#define VIER    ShiftInTime("four ",  16, 3,              1,0);
#define NEGEN   ShiftInTime("nine ",  17, 3,              1,1);
#define DRIE    ShiftInTime("three ", 18, 3,              1,2);
#define ACHT    ShiftInTime("eight ", 19, 3,              1,3);
#define ZEVEN   ShiftInTime("seven ", 20, 3,              1,4);
#define EEN     ShiftInTime("one ",   21, 3,              1,5);
#define UUR     ShiftInTime("O'clock",22, 3,              1,6);
#define VOOR    ShiftInTime("to "     23, 3, ToggleEdsoft  ,7);
                #endif //UK
//--------------------------------------------
// PIN Assigments
//-------------------------------------------- 
#if defined(__AVR_ATmega328P__) 
// Digital hardware constants ATMEGA 328 ----
enum DigitalPinAssignments {
  DCF_PIN      = 2,               // DCFPulse on interrupt  pin
                                      #ifdef ROTARYMOD  
  encoderPinA  = 3,               // right (labeled DT on decoder)on interrupt  pin
  clearButton  = 4,               // switch (labeled SW on decoder)
  encoderPinB  = 8,               // left (labeled CLK on decoder)no interrupt pin  
                                      #endif //ROTARYMOD  
  PWMpin       = 5,               // Pin that controle PWM signal on BC327 transistor to dim light
                                      #ifdef BLUETOOTHMOD  
  BT_RX        = 6,               // BT_RX connect to TXD op de BT module
  BT_TX        = 7,               // BT_TX connect to RXD op de BT module
                                      #endif // BLUETOOTHMOD  
  HC_12TX      = 6,                // HC-12 TX Pin  // note RX and TX are reversed compared with a BT Module
  HC_12RX      = 7,                // HC-12 RX Pin                                      
                                    #ifdef FOURWIREKEYPAD   
  Button2      = 5,               // Plus 
  Button4      = 6,               // Select mode / start
  Button1      = 7,               // Minus 
  Button3      = 8,               // Select mode / start
                                   #endif // FOURWIREKEYPAD    

  DCF_LED_Pin  = 9,               // define LED pin voor DCF pulse
  LEDDataPin   = 10,              // blauw HC595
  LEDStrobePin = 11,              // groen HC595
  LEDClockPin  = 12,              // geel  HC595
  secondsPin   = 13};
                                  // Analogue hardware constants ----
enum AnaloguePinAssignments {
  EmptyA0       = 0,              // A0
  EmptyA1       = 1,              // A1
  PhotoCellPin  = 2,              // LDR pin
  OneWirePin    = 3,              // 
  SDA_pin       = 4,              // SDA pin
  SCL_pin       = 5};             // SCL pin
# endif

//                                                                                            //
//--------------------------------------------//-------------------------------------------- 
#if defined(__AVR_ATmega1284P__) || defined(__AVR_ATmega1284__)
                                  // Digital hardware constants ATMEGA 1284P ----
enum DigitalPinAssignments {
  BT_RX        = 0,               // Bluetooth RX
  BT_TX        = 1,               // Bluetooth TX
  DCF_PIN      = 2,               // DCFPulse on interrupt pin
  PWMpin       = 3,               // Pin that controle PWM signal on BC327 transistor to dim light
  MAX7219_DIN  = 4,               // MAX7219 DIN gr     PB4 PWM
  MAX7219_CS   = 5,               // MAX7219 CS  ge     PB5 digital
  MAX7219_CLK  = 6,               // MAX7219 CLK or     PB6 PWM  
  DS1820Temp   = 7,               // DS1820 temperature PB7 PWM 
  PIN08        = 8,               // RX1                PD0 digital
  PIN09        = 9,               // TX1                PD1 digital
  LED10        = 10,              // LED10              PD2 digital
  encoderPinB  = 11,              // left (labeled CLK on decoder) no interrupt pin  PD3 digital
  encoderPinA  = 12,              // right (labeled DT on decoder) no interrupt pin  PD4 PWM
  clearButton  = 13,              // switch (labeled SW on decoder)                  PD5 PWM
  DCF_LED_Pin  = 14,              // define pin voor DCF signal Led                  PD6 PWM
  PIN15        = 15,              // LED15                                           PD7 PWM
  SCL_pin      = 16,              // SCL pin       PC0 interrupt
  SDA_pin      = 17,              // SDA pin       PC1 interrupt
  PIN18        = 18,              // Empty         PC2 digital
  LED19        = 19,              // LED19         PC3 digital
  LEDDataPin   = 20,              // blauw HC595   PC4 digital
  LEDStrobePin = 21,              // groen HC595   PC5 digital
  LEDClockPin  = 22,              // geel  HC595   PC6 digital
  secondsPin   = 23};             //               PC7 digital
                                  // Analogue hardware constants ----
enum AnaloguePinAssignments {
  EmptyA0      = 24,              // A0
  EmptyA1      = 25,              // A1
  PhotoCellPin = 26,              // LDR pin A2
  OneWirePin   = 27,              // A3
  EmptyA4      = 28,              // A4
  EmptyA5      = 29,              // A5
  EmptyA6      = 30};             // A6
 # endif 
//--------------------------------------------
// KY-040 ROTARY
//-------------------------------------------- 
                                  #ifdef ROTARYMOD                         
Encoder myEnc(encoderPinA, encoderPinB);    // Use digital pin  for encoder
                                  #endif //ROTARYMOD      
unsigned long Looptime          = 0;
unsigned long RotaryPressTimer  = 0;
byte          NoofRotaryPressed = 0;
//--------------------------------------------
// LDR PHOTOCELL
//--------------------------------------------
const byte MAXBRIGHTNESS    = 120;           // Factor (%) to dim LED intensity with. Between 1% and 250%
const byte LOWBRIGHTNESS    = 20;           // Lower limit of Brightness ( 0 - 255)   
bool  LEDsAreOff            = false;        // If true LEDs are off except time display
byte  BrightnessCalcFromLDR = 32;           // Initial brightness value The intensity send to the LEDs (0-255)
byte  Menumem[24];                          // Storage of DCF or LDR readings per hour
byte  TestLDR               = false;        // If true LDR inf0 is printed every second in serial monitor
int   Previous_LDR_read     = 512;          // The actual reading from the LDR + 4x this value /5
int   OutPhotocell;                         // Stores reading of photocell;
int   MinPhotocell          = 1023;         // Stores minimum reading of photocell;
int   MaxPhotocell          = 1;            // Stores maximum reading of photocell;
int   ToggleEdsoft          = 1;
uint32_t SumLDRreadshour    = 0;
uint32_t NoofLDRreadshour   = 0;
//                                                                                            //
//--------------------------------------------
// CLOCK
//--------------------------------------------                                 
#define MAXTEXT 50
static unsigned long msTick;                // Millisecond ticks 
int    count; 
byte   Isecond, Iminute, Ihour , Iday, Imonth, Iyear; 
byte   Display1 = 0 , Display2 = 0, Display3 = 0;
byte   lastday  = 0,lastminute = 0, lasthour = 0, sayhour  = 0;
int    Delaytime            = 200;
byte   Toggle_HetWasIs      = 1;            // Turn On/Off HetIsWas lights
int    Toggle_HetWasIsUit   = 0;            // Turn off HetIsWas after 10 sec
byte   ChangeTime           = false;
byte   ChangeLightIntensity = false;
byte   SecPulse             = 0;            // Give a pulse to the Isecond led
byte   Demo                 = false;
byte   Zelftest             = false;
byte   hbval                = 128;
byte   hbdelta              = 8;
String SerialString;

//                                                                                            //
//--------------------------------------------
// DS3231 CLOCK MODULE
//--------------------------------------------
#define DS3231_I2C_ADDRESS          0x68
#define DS3231_TEMPERATURE_MSB      0x11
#define DS3231_TEMPERATURE_LSB      0x12
                                  #ifdef MOD_DS3231
RTC_DS3231 RTCklok;    //RTC_DS1307 RTC; 
                                  #else
RTC_Millis RTCklok;   
                                  #endif  //MOD_DS3231
DateTime Inow;

