ednieuw/ESP32-HC12/Character_Clock_V117_PA03/Character_Clock_V117_PA03.ino
//--------------------------------------------
// BLUETOOTH
//--------------------------------------------                                     
                                      #ifdef BLUETOOTHMOD               // Bluetooth ---------------------
SoftwareSerial Bluetooth(BT_RX, BT_TX);     // RX <=> TXD on BT module, TX <=> RXD on BT module
                                      #endif // BLUETOOTHMOD  

//------------------------------------------------------------------------------
// HC-12 Long Range Wireless Communication Module
//------------------------------------------------------------------------------
                          #ifdef HC12MOD
SoftwareSerial HC12(HC_12TX, HC_12RX);                            // HC-12 TX Pin, HC-12 RX Pin
                          #endif  //HC12MOD                                       

//--------------------------------------------
// DCF-2 DCF77 MODULE
//--------------------------------------------
byte DCF_signal = 50;                                                                         // Is a proper time received?
byte DCF_counts = 0;                                                                          // Valid DCF receptions per hour
bool SeeDCFsignalInDisplay = false;                                                           // If ON then the display line HET IS WAS will show the DCF77-signal received
bool UseDCF                = true;                                                            // Use the DCF-receiver or not

                                  #ifdef DCF77MOD                                             // DCF77 ------------------------------
//                                                                                            //
#if defined(__AVR_ATmega328P__) 
#define DCF_INTERRUPT 0                     // DCF Interrupt number associated with DCF_PIN
#endif
#if defined(__AVR_ATmega1284P__) || defined(__AVR_ATmega1284__)
#define DCF_INTERRUPT 2                     // DCF Interrupt number associated with DCF_PIN
#endif
DCF77 DCF = DCF77(DCF_PIN,DCF_INTERRUPT,LOW);
                                  #endif //DCF77MOD              
                                  #ifdef LCDMOD
//--------------------------------------------
// LCD Module
//--------------------------------------------
//LiquidCrystal_I2C lcd(0x27,2,1,0,4,5,6,7);// 0x27 is the I2C bus address for an unmodified backpack
LiquidCrystal_I2C lcd(0x3F, 2, 1, 0, 4, 5, 6, 7, 3, POSITIVE);                                // 0x27 or 0x3F is the I2C bus address for an unmodified backpack
                                  #endif // LCDMOD 
                                  #ifdef MAX7219_8DIGIT
//----------------------------------------
// MAX7219_8DIGIT  
//----------------------------------------
// MAX7219_DIN is connected to the DataIn, MAX7219_CLK is connected to the CLK, MAX7219_CS is connected to LOAD  We have only a single MAX72XX.
LedControl lc = LedControl( MAX7219_DIN, MAX7219_CLK, MAX7219_CS, 1 );
                                  #endif //MAX7219_8DIGIT         
//----------------------------------------
// Temperature sensor DS1820 
//----------------------------------------
                     #ifdef DS1820
#define           TEMPERATURE_PRECISION 9                                                     // A DS18B20 takes from 94ms (9-bit resolution) to 750ms (12-bit resolution) to convert temperature 
OneWire           oneWire(DS1820Temp);                                                        // Setup a oneWire instance to communicate with any OneWire devices  DS1820Temp
DallasTemperature Tempsensors(&oneWire);                                                      // Pass our oneWire reference to Dallas Temperature. 
DeviceAddress     tempDeviceAddress;                                                          // We'll use this variable to store a found device address
int               numberOfDevices;                                                            // Number of temperature devices found
                     #endif //DS1820
//----------------------------------------
// Common
//----------------------------------------
//                                                                                            //
char sptext[MAXTEXT+2];                                                                       // For common print use   
uint16_t  MilliSecondValue  = 10;                                                             // The duration of a second  minus 1 ms. Used in Demo mode
struct EEPROMstorage {                                                                        // Data storage in EEPROM to maintain them after power loss
  byte LightReducer;
  byte LowerBrightness;
  byte TurnOffLEDsAtHH;
  byte TurnOnLEDsAtHH;
  unsigned int  DCForLDR;
} Mem ; 
                    // End Definitions  ---------------------------------------------------------
                               
//--------------------------------------------
// ARDUINO Loop
//--------------------------------------------
void loop(void)
{
if (Demo)          Demomode();
else if (Zelftest) Selftest();                                                                // 
else               EverySecondCheck();                                                        // Let the second led tick and run the clock program
InputDevicesCheck();                                                                          // Check input from input devices
}  
//--------------------------------------------
// ARDUINO Setup
//--------------------------------------------
void setup()
{                                                                                              // Initialise the hardware // initialize the appropriate pins as outputs:
 Serial.begin(9600);                                                                           // Setup the serial port to 9600 baud 
 Tekstprintln("***\nSerial started\nInstalled:");
 Wire.begin();                                                                                 // Start the wire communication I2C
                                  #ifdef  MOD_DS3231
 RTCklok.begin();                                                                              // Start the DS3231 RTC-module
 Tekstprintln("DS3231 RTC");
                                  #endif //MOD_DS3231
 pinMode(LEDClockPin,  OUTPUT); 
 pinMode(LEDDataPin,   OUTPUT); 
 pinMode(LEDStrobePin, OUTPUT); 
 pinMode(PWMpin,       OUTPUT);
 pinMode(secondsPin,   OUTPUT );
                                  #ifdef ROTARYMOD   
 pinMode(encoderPinA,  INPUT_PULLUP);
 pinMode(encoderPinB,  INPUT_PULLUP);  
 pinMode(clearButton,  INPUT_PULLUP); 
 Tekstprintln("Rotary"); 
 myEnc.write(0);                                                                             // Clear Rotary encode buffer
                                  #endif //ROTARYMOD  
                                  #ifdef FOURWIREKEYPAD   
  pinMode(Button1,  INPUT_PULLUP);
  pinMode(Button2,  INPUT_PULLUP);
  pinMode(Button3,  INPUT_PULLUP);
  pinMode(Button4,  INPUT_PULLUP);  
 Tekstprintln("Four wire keypad");                                                           // The one wire keypad is enabled
                                  #endif // FOURWIREKEYPAD                                 
                                  #if defined(__AVR_ATmega1284P__) || defined(__AVR_ATmega1284__)
 pinMode(LED10,        OUTPUT );
 pinMode(LED19,        OUTPUT );
                                  #endif
                                  #ifdef KEYPAD3x1
 // keypad.addEventListener(keypadEvent);                                                    // No interrupt needed. Loop is fast enought. Start the 3x1 keypad
 Tekstprintln("3*1 keypad");  
 digitalWrite(COLPIN,LOW);
                                  #endif //KEYPAD3x1
                                  #ifdef ONEWIREKEYPAD3x4  
 Tekstprintln("Onewire keypad");                                                             // The one wire keypad is enabled
                                  #endif //ONEWIREKEYPAD3x4

