ednieuw/ESP32-HC12/Character_Clock_V117_PA03/Character_Clock_V117_PA03.ino
                                  #ifdef BLUETOOTHMOD   
 Bluetooth.begin(9600);                                                                      // Setup the Bluetooth port to 9600 baud 
 Tekstprintln("Bluetooth enabled");
                                  #endif //BLUETOOTHMOD
                          #ifdef HC12MOD
 HC12.begin(9600);               // Serial port to HC12
 Tekstprintln("HC-12 time receiver enabled");
                          #endif  //HC12MOD                                        

                                  #ifdef DS1820         
 setupDS1820();
                                  #endif //DS1820
                                  #ifdef DCF77MOD         
 pinMode(DCF_LED_Pin,  OUTPUT);
 pinMode(DCF_PIN,INPUT_PULLUP); 
 DCF.Start();                                                                                // Start the DCF-module
 Tekstprintln("DCF77");
                                  #endif //DCF77MOD
                                  #ifdef LCDMOD         
 lcd.begin (16,2);                                                                           // Activate LCD module
 lcd.setBacklightPin(3,POSITIVE);
 lcd.setBacklight(HIGH); 
 Tekstprintln("LCD"));
                                  #endif //LCDMOD 
                                  #ifdef MAX7219_8DIGIT 
 lc.shutdown(0,false);
 lc.setIntensity(0,2);                                                                       // Set the brightness to a medium values 
 lc.clearDisplay(0);                                                                         // and clear the display
 Tekstprintln("MAX7219");
                                  #endif //MAX7219_8DIGIT
 analogWrite(PWMpin, BrightnessCalcFromLDR);                                                 // The duty cycle: between 0 (lights off) and 255 (light full on).    
 GetTijd(1);                                                                                 // Get the time and print it to serial                
 DateTime now = RTCklok.now();                                                               // Get the time from the RTC
 DateTime compiled = DateTime(__DATE__, __TIME__);
 if (now.unixtime() < compiled.unixtime()) 
   {
    Tekstprintln("RTC Updating");                                                            // Following line sets the RTC to the date & time this sketch was compiled
    RTCklok.adjust(DateTime(F(__DATE__), F(__TIME__))); 
   } 
 EEPROM.get(0,Mem);                                                                          // Get the data from EEPROM
 Mem.LightReducer    = constrain(Mem.LightReducer,   1, 250);                                // 
 Mem.LowerBrightness = constrain(Mem.LowerBrightness,1, 250);                               // 
 Mem.TurnOffLEDsAtHH = min(Mem.TurnOffLEDsAtHH, 23);                                         //
 Mem.TurnOnLEDsAtHH  = min(Mem.TurnOnLEDsAtHH,  23);                                         //
 Mem.DCForLDR        = min(Mem.DCForLDR,  1);                                                //
 EEPROM.put(0,Mem);                                                                          // Update EEPROM if some data are out of the constrains
 SWversion();                                                                                // Display the version number of the software
// Selftest();                                                                               // Play the selftest
 Previous_LDR_read = analogRead(PhotoCellPin);                                               // to have a start value
 MinPhotocell      = Previous_LDR_read;                                                      // Stores minimum reading of photocell;
 MaxPhotocell      = Previous_LDR_read;                                                      // Stores maximum reading of photocell;
 GetTijd(0);                                                                                 // Get the time (to be sure time is correct) and do not print it to serial 
 lasthour = Ihour;
 while (Serial.available())  char c = Serial.read();                                         // Flush the serial buffer. When a Bluetooth module is connected to RX/TX pin 0&1 garbage can set the time to 00:00:00
 Looptime          = millis();                                                               // Used in KY-040 rotary
 TestLDR           = false;
 msTick            = Looptime; 
}
//                                                                                           //
// --------------------------- END SETUP     
//--------------------------------------------
// Menu definition
// Keep chars per line a few chars less than nn in array definition menu[][nn]
//--------------------------------------------  
//0        1         2         3         4         5
//12345678901234567890123456789012345678901234567890
const char menu[][33] PROGMEM =  {
 "Woordklok No4",
 "Enter time as hhmmss or hhmm",
 "A Normal display",
 "B HET IS WAS always off",
 "C HET IS WAS off after 10 secs",
 "D D15122017 is 15 Dec 2017",
                                   #ifdef DCF77MOD   
 "F DCF or LDR counts/h",
 "G Display DCF-signal",
 "H Use DCF-receiver",
                                  #endif //DCF77MOD   
 "I For this info",
 "L Min light intensity (0-255)",
 "M Max light intensity (1-250)",
 "N LEDs OFF between Nhhhh",
 "O LEDs ON/OFF",
 "R Reset to default settings",
 "S Self test",
 "W Test LDR every second",
 "X Demo mode (Xmsec)",
 "Ed Nieuwenhuys April 2022" };                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                             
//--------------------------------------------
// CLOCK Version info
//--------------------------------------------
// Storing strings in PROGMEM saves 
// global variable memory
//--------------------------------------------
//0        1         2         3
//123456789012345678901234567890
const char SWVER[][28] PROGMEM =  {
 "LDR average bits per hour",
 "DCF receptions per hour",
 "Brightness Min  : ",
 "LDR read Min    :",
 "LEDs off between: ",
 "DCF-receiver is : ",
 "Software: "};

