ednieuw/ESP32-HC12/Character_Clock_V117_PA03/Character_Clock_V117_PA03.ino
//--------------------------------------------
// CLOCK Menu and Version info
//--------------------------------------------
void SWversion(void) 
{ 
 unsigned int i;
 PrintLine(40);
 for (i = 0; i < sizeof(menu) / sizeof(menu[0]); i++)   {strcpy_P(sptext, menu[i]);                Tekstprintln(sptext);}
 PrintLine(47);
 sprintf(sptext,"%s",strcpy_P(sptext, SWVER[Mem.DCForLDR]));                                       Tekstprintln(sptext);
 for (i=0;i<12;i++) { sprintf(sptext," %02d ",i );        Tekstprint(sptext); }                    Tekstprintln("");
 for (i=0;i<12;i++) { sprintf(sptext,"%03d ",Menumem[i]); Tekstprint(sptext); }                    Tekstprintln("");
 for (i=12;i<24;i++){ sprintf(sptext,"%03d ",Menumem[i]); Tekstprint(sptext); }                    Tekstprintln("");
 PrintLine(47);
 sprintf(sptext,"%s%3d bits Max: %3d%%",strcpy_P(sptext, SWVER[2]),Mem.LowerBrightness, Mem.LightReducer); Tekstprintln(sptext);
 sprintf(sptext,"%s%4d bits Max: %3d bits",strcpy_P(sptext, SWVER[3]),MinPhotocell, MaxPhotocell);  Tekstprintln(sptext); 
 sprintf(sptext,"%s%02d - %02d",strcpy_P(sptext,SWVER[4]),Mem.TurnOffLEDsAtHH,Mem.TurnOnLEDsAtHH);  Tekstprintln(sptext);
                                   #ifdef DCF77MOD   
 sprintf(sptext,"%s%s  Signal:%3d%%",strcpy_P(sptext,SWVER[5]),UseDCF ? "On" : "Off",DCF_signal);   Tekstprintln(sptext);
                                   #endif // DCF77MOD   
 sprintf(sptext,"%s%s",strcpy_P(sptext,SWVER[6]),VERSION);                                          Tekstprintln(sptext); 
 GetTijd(1);  
 PrintLine(47);
}
//--------------------------------------------
// CLOCK Print line with underscores
//--------------------------------------------
void PrintLine(byte Lengte)
{
 sptext[0] = 0;
 for (int n=0; n<Lengte; n++) strcat(sptext,"_");
 Tekstprintln(sptext);      
}
//                                                                                            //
//--------------------------------------------
// ARDUINO Reset to default settings
//--------------------------------------------
void Reset(void)
{
 Mem.LightReducer     = MAXBRIGHTNESS;                                                        // Factor to dim ledintensity with. Between 0.1 and 1 in steps of 0.05
 Mem.LowerBrightness  = LOWBRIGHTNESS;                                                        // Lower limit of Brightness ( 0 - 255)
 Mem.TurnOffLEDsAtHH  = Mem.TurnOnLEDsAtHH = 0;                                               // Reset Off On time
 Mem.DCForLDR         = 0;                                                                    // LDR reading in menu
 EEPROM.put(0,Mem);                                                                           // Update EEPROM if some data are out of the constrains                                                 
 Previous_LDR_read    = analogRead(PhotoCellPin);                                             // To have a start value
 MinPhotocell         = Previous_LDR_read;                                                    // Stores minimum reading of photocell;
 MaxPhotocell         = Previous_LDR_read;                                                    // Stores maximum reading of photocell;
 TestLDR              = false;                                                                // If true LDR display is printed every second
 NoofRotaryPressed    = 0; 
 SeeDCFsignalInDisplay= false;
 ChangeTime           = false;
 ChangeLightIntensity = false;
 Demo                 = false;
 Zelftest             = false;
 for (int i=0;i<24;i++) Menumem[i] = 1;                                                       // Reset LDR/DCF readings
 Selftest();                                                                                  // Play the selftest
 GetTijd(0);                                                                                  // Get the time and store it in the proper variables
 SWversion();                                                                                 // Display the version number of the software
 Displaytime();
}
//                                                                                            //
//--------------------------------------------
// CLOCK Update routine done every second
//--------------------------------------------
void EverySecondCheck(void)
{ 
  uint32_t ms = millis() - msTick;                                                            // A Digitalwrite() is very time consuming. 
  static bool Dpin;                                                                           // Only write once to improve program speed in the loop()
  if ( ms >1 && Dpin) {Dpin = LOW; digitalWrite(secondsPin,LOW);}                             // Turn OFF the second on pin 13 
  if ( ms >999)                                                                               // Flash the onboard Pin 13 Led so we know something is happening
  {    
   msTick = millis();                                                                         // second++; 
   digitalWrite(secondsPin,HIGH);                                                             // turn ON the second on pin 13
   Dpin = HIGH;
   ++SecPulse;                                                                                // second routine in function DimLeds
   GetTijd(0);                                                                                // synchronize time with RTC clock
                       #ifdef LCDMOD
   Print_tijd_LCD();
                       #endif //LCDMOD
   if ((Toggle_HetWasIsUit == 2) && (Isecond > 10)) Toggle_HetWasIs = 0; 
      else Toggle_HetWasIs = 1;                                                               // HET IS WAS is On
   if(Isecond % 30 == 0) DimLeds(true);                                                       // Led Intensity Control + seconds tick print every 30 seconds   
      else               DimLeds(TestLDR);
  if ((Toggle_HetWasIsUit == 2) && (Isecond == 11))Displaytime();                             // turn Leds OFF on second == 11
  if(Iminute == 0 && Isecond <9)
   { 
    ToggleEdsoft = Isecond % 2;                                                               // ToggleEdsoft becomes 0 or 1 and turn on and off the first seconds at minute 0 the Edsoft light on pin 24
    Serial.println(ToggleEdsoft);
    Displaytime();
   }
                     #ifdef DS1820
   DS1820read();
                     #endif //DS1820
  if (Iminute != lastminute) EveryMinuteUpdate();  
  }
 }
//--------------------------------------------
// CLOCK Update routine done every minute
//--------------------------------------------
 void EveryMinuteUpdate(void)
 {
  lastminute = Iminute;
  Displaytime();
  Print_RTC_tijd();
                                    #ifdef DCF77MOD  
  DCF_signal--;
  DCF_signal = constrain((byte) DCF_signal,1,99); 
                                    #endif // DCF77MOD  
  if(Ihour != lasthour) EveryHourUpdate();
 }
//--------------------------------------------
// CLOCK Update routine done every hour
//--------------------------------------------
void EveryHourUpdate(void)
{
 GetTijd(0); 
 if(Ihour == Mem.TurnOffLEDsAtHH) LEDsAreOff = true;                                          // Is it time to turn off the LEDs?
 if(Ihour == Mem.TurnOnLEDsAtHH)  LEDsAreOff = false;                                         // Or on?
                                    #ifdef DCF77MOD    
 Menumem[lasthour] =  DCF_counts;                                                             // Valid DCF receptions
 DCF_counts        = 0;                                                                       // Valid DCF receptions per hour
 
                                    #else
 Menumem[lasthour] = SumLDRreadshour / NoofLDRreadshour;                                      // Update the average LDR readings per hour
                                    # endif  //DCF77MOD
 SumLDRreadshour  = 0;
 NoofLDRreadshour = 0;
 lasthour = Ihour;
 if (Iday != lastday) EveryDayUpdate(); 
}
//                                                                                            //
//--------------------------------------------
// CLOCK Update routine done every day
//--------------------------------------------
void EveryDayUpdate(void)
{
 lastday = Iday;                                                                              // Not much to do at the moment
 MinPhotocell = 999;                                                                          // Stores minimum reading of photocell;
 MaxPhotocell = 1;                                                                            // Stores maximum reading of photocell;
}
//                                                                                            //
//--------------------------------------------
// CLOCK common print routines
//--------------------------------------------
void Tekstprint(char const *tekst)
{
 Serial.print(tekst);    
                                  #ifdef BLUETOOTHMOD
 //Bluetooth.print(tekst);  
                                  #endif //BLUETOOTHMOD
}
void Tekstprintln(char const *tekst)
{
 Serial.println(tekst);    
                                  #ifdef BLUETOOTHMOD
 //Bluetooth.println(tekst);
                                  #endif //BLUETOOTHMOD
}
//------------------------------------------------------------------------------
// CLOCK check for input from devices
// This fubction is called from with the loop()
//------------------------------------------------------------------------------
//                                                                                            //
void InputDevicesCheck(void)
{
 SerialCheck();
                                  #ifdef DCF77MOD
 if(UseDCF)  DCF77Check();
                                  #endif  //DCF77MOD
                                  #ifdef BLUETOOTHMOD   
 BluetoothCheck(); 
                                  #endif  //BLUETOOTHMOD                                 
                                  #ifdef ROTARYMOD      
 RotaryEncoderCheck(); 
                                  #endif  //ROTARYMOD
                                  #ifdef KEYPAD3x4   
 Keypad3x4Check(); 
                                  #endif  //KEYPAD3x4
                                  #ifdef KEYPAD3x1   
 Keypad3x1Check(); 
                                  #endif  //KEYPAD3x1
                                  #ifdef ONEWIREKEYPAD3x4   
 OnewireKeypad3x4Check(); 
                                  #endif  //ONEWIREKEYPAD3x4
                                  #ifdef ONEWIREKEYPAD3x1   
 OnewireKeypad3x1Check(); 
                                  #endif  //ONEWIREKEYPAD3x1
                                  #ifdef FOURWIREKEYPAD 
 FourwireKeypadCheck();
                                  #endif //FOURWIREKEYPAD                        
                                  #ifdef HC12MOD
 HC12Check();
                                  #endif  //HC12MOD 
                                  #ifdef ARDUINO_SAMD_MKRWIFI1010
 WIFIServercheck(); 
                                  #endif
}


//------------------------------------------------------------------------------
// CLOCK Demo mode
//------------------------------------------------------------------------------
//                                                                                            //
void Demomode(void)
{
 if ( millis() - msTick == 10)   digitalWrite(secondsPin,LOW);                                // Turn OFF the second on pin 13
 if ( millis() - msTick >= MilliSecondValue)                                                  // Flash the onboard Pin 13 Led so we know something is happening
 {    
  msTick = millis();                                                                          // second++; 
  digitalWrite(secondsPin,HIGH);                                                              // Turn ON the second on pin 13
  //Isecond = 60-Iminute;
  if( ++Iminute >59) { Iminute = 0; Isecond = 0; Ihour++;}
  if( Ihour >12) Ihour = 0;                                                                   // If hour is after 12 o'clock 
  DimLeds(false);
  Displaytime();
  Tekstprintln("");
  SerialCheck();
 }
}

//------------------------------------------------------------------------------
// CLOCK check for serial input
//------------------------------------------------------------------------------
void SerialCheck(void)
{
 String SerialString = "";
 while (Serial.available())
  {
   char c = Serial.read();  delay(3); 
   if (c>31 && c<127) SerialString += c;                                                      // allow input from Space - Del
   else c = 0;
  }
 if (SerialString.length()>0)     ReworkInputString(SerialString);                            // Rework ReworkInputString();
 SerialString = "";
}
                                  #ifdef HC12MOD
//------------------------------------------------------------------------------
// CLOCK check for HC-12 input
//------------------------------------------------------------------------------  
//                                                                                            //                          
void HC12Check(void)
{
 String HC12String = ""; 
 HC12String.reserve(64);
 HC12String ="";
 HC12.listen();                                                                               // When using two software serial ports, you have to switch ports by listen()ing on each one in turn.
 while (HC12.available()>0)                                                                   // If HC-12 has data
   {       
    char c = HC12.read();     
    if (c>31 && c<127)  HC12String += c;
    else c = 0;                                                                               // Allow only input from Space - Del
    delay(3);
   }
// HC12String += "\n";
 if (HC12String.length()>0 && HC12String.length()<8)  // T123456 totals 7 
   {
    Serial.print("Received HC-12: "); Serial.println(HC12String);
    ReworkInputString(HC12String);
     HC12String ="";
    }                  
}                         
                                  #endif  //HC12MOD

                           
